ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/TARGET_PSoC6_CY8C_CM0p/device/system_psoc6ble_cm0plus.c
/***************************************************************************//**
* \file system_psoc6ble_cm0plus.c
* \version 1.0
*
* The device system-source file.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include <stdint.h>
#include <stdbool.h>
#include "system_psoc6ble_cm0plus.h"
#include "cy_device_headers.h"

#include "ipc/cy_ipc_drv.h"
#include "ipc/cy_ipc_pipe.h"
#include "ipc/cy_ipc_lock.h"
#include "sysint/cy_sysint.h"

/*******************************************************************************
* Inter Process Communication (IPC)
*******************************************************************************/
cy_stc_ipc_pipe_ep_t cy_ipc_pipe_sysEpArray[CPUSS_IPC_IPC_NR];
uint32_t ipcLockArray[CY_IPC_LOCK_COUNT/CY_IPC_LOCKS_PER_WORD];
cy_ipc_pipe_callback_ptr_t  ipc_pipe_cyPipeCbArray[CY_IPC_CYPIPE_CLIENT_CNT];


/*******************************************************************************
* SystemCoreClockUpdate()
*******************************************************************************/

/** Default HFClk frequency in Hz */
#define CY_HFCLK0_FREQ_HZ_DEFAULT       ( 8000000UL)

/** Default PeriClk frequency in Hz */
#define CY_PERICLK_FREQ_HZ_DEFAULT      (4000000UL)

/** Default SlowClk system core frequency in Hz */
#define CY_SYSTEM_CLOCK_FREQ_HZ_DEFAULT (4000000UL)


#define CY_IMO_FREQ_HZ                  ( 8000000UL)
#ifndef CY_EXT_FREQ_HZ
    #define CY_EXT_FREQ_HZ              (24000000UL)
#endif
#ifndef CY_ECO_FREQ_HZ
    #define CY_ECO_FREQ_HZ              (24000000UL)
#endif

#if defined (CY_IP_MXBLESS) && (CY_IP_MXBLESS == 1UL)
    #ifndef CY_ALTHF_FREQ_HZ
        #define CY_ALTHF_FREQ_HZ        (32000000UL)
    #endif
    uint32_t cy_BleEcoClockFreqHz = CY_ALTHF_FREQ_HZ;
#endif /* defined (CY_IP_MXBLESS) && (CY_IP_MXBLESS == 1UL) */

#define CY_ROOT_PATH_SRC_IMO            (0UL)
#define CY_ROOT_PATH_SRC_EXT            (1UL)
#define CY_ROOT_PATH_SRC_ECO            (2UL)
#define CY_ROOT_PATH_SRC_ALTHF          (3UL)

/** Holds the SlowClk system core clock, which is the system clock frequency supplied to the SysTick timer and the
* processor core clock. This variable can be used by debuggers to query the frequency of the debug timer or to configure
* the trace clock speed.
*
* \attention Compilers must be configured to avoid removing this variable in case the application program is not using
* it. Debugging systems require the variable to be physically present in memory so that it can be examined to configure
* the debugger. */
uint32_t SystemCoreClock = CY_SYSTEM_CLOCK_FREQ_HZ_DEFAULT;

/** Holds the HFClk0 clock frequency. Updated by \ref SystemCoreClockUpdate(). */
uint32_t cy_Hfclk0FreqHz  = CY_HFCLK0_FREQ_HZ_DEFAULT;

/** Holds the PeriClk clock frequency. Updated by \ref SystemCoreClockUpdate(). */
uint32_t cy_PeriClkFreqHz = CY_PERICLK_FREQ_HZ_DEFAULT;


/* Do not use these definitions directly in your application */
#define CY_DELAY_MS_OVERFLOW_THRESHOLD  (0x8000u)
#define CY_DELAY_1K_THRESHOLD           (1000u)
#define CY_DELAY_1K_MINUS_1_THRESHOLD   (CY_DELAY_1K_THRESHOLD - 1u)
#define CY_DELAY_1M_THRESHOLD           (1000000u)
#define CY_DELAY_1M_MINUS_1_THRESHOLD   (CY_DELAY_1M_THRESHOLD - 1u)
uint32_t cy_delayFreqHz   = CY_SYSTEM_CLOCK_FREQ_HZ_DEFAULT;
uint32_t cy_delayFreqKhz  = (CY_SYSTEM_CLOCK_FREQ_HZ_DEFAULT + CY_DELAY_1K_MINUS_1_THRESHOLD) / CY_DELAY_1K_THRESHOLD;
uint8_t cy_delayFreqMhz  = (uint8_t)((CY_SYSTEM_CLOCK_FREQ_HZ_DEFAULT + CY_DELAY_1M_MINUS_1_THRESHOLD) / CY_DELAY_1M_THRESHOLD);
uint32_t cy_delay32kMs    = CY_DELAY_MS_OVERFLOW_THRESHOLD * ((CY_SYSTEM_CLOCK_FREQ_HZ_DEFAULT + CY_DELAY_1K_MINUS_1_THRESHOLD) /
                        CY_DELAY_1K_THRESHOLD);


/*******************************************************************************
* Table Of Content (TOC)
*******************************************************************************/
typedef struct {
    uint32_t    securityImageAddr;  /**  Address of security image               */
    uint32_t    flashBootAddr;      /**  Address of Flash Boot stored in SFLASH  */
    uint32_t    flashBootSize;      /**  Size of Flash Boot (in bytes)           */
    uint32_t    objectOneAddr;      /**  Address of next object (0 if none)      */
    uint32_t    objectOneSize;      /**  Size of next object (0 if none)         */
    uint32_t    objectTwoAddr;      /**  Address of next object (0 if none)      */
    uint32_t    objectTwoSize;      /**  Size of next object (0 if none)         */
    uint32_t    objectThreeAddr;    /**  Address of next object (0 if none)      */
    uint32_t    objectThreeSize;    /**  Size of next object (0 if none)         */
    uint32_t    userAppAddr;        /**  Address of start of User Application    */
    uint32_t    userAppSize;        /**  Size of the User Application            */
    uint32_t    keyStorageAddr;     /**  Address of Key Storage Flash Blocks.    */
    uint32_t    keyStorageSize;     /**  Size of key storage area in bytes.      */
    uint32_t    smifConfigAddr;     /**  SMIF Configuration Table                */
    uint32_t    reserved[113u];
    uint32_t    crc;                /** 0x1FC   CRC16-CCITT                      */
} Cy_TOC_Type;


#define CY_TOC_BASE                     (0x100FFE00UL)
#define CY_TOC                          ((Cy_TOC_Type*) CY_TOC_BASE)

#ifndef CY_TOC_FLASH_BOOT_ADDR
    #define CY_TOC_FLASH_BOOT_ADDR      (0x160020D8UL)
#endif

#ifndef CY_TOC_FLASH_BOOT_SIZE
    #define CY_TOC_FLASH_BOOT_SIZE      (0x2000UL)
#endif

#ifndef CY_TOC_SMIF_CONFIG_ADDR
    #define CY_TOC_SMIF_CONFIG_ADDR     (0xFFFFFFFFUL)
#endif

#ifndef CY_TOC_USER_APP_ADDR
    #define CY_TOC_USER_APP_ADDR        (0x10000000UL)
#endif

#ifndef CY_TOC_USER_APP_SIZE
    #define CY_TOC_USER_APP_SIZE        (0x80000UL)
#endif

#ifdef CY_TOC_PRESENT
    #if defined(__GNUC__) || defined(__ARMCC_VERSION)
    __attribute__ ((__section__(".cy_toc"), used))
    #elif defined(__ICCARM__)
    #pragma  location=".cy_toc"
    #endif
    Cy_TOC_Type cyToc = {
        .flashBootAddr = CY_TOC_FLASH_BOOT_ADDR,
        .flashBootSize = CY_TOC_FLASH_BOOT_SIZE,
        .smifConfigAddr = CY_TOC_SMIF_CONFIG_ADDR,
        .userAppAddr = CY_TOC_USER_APP_ADDR,
        .userAppSize = CY_TOC_USER_APP_SIZE
    };
#endif


