ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/TARGET_PSoC6_CY8C_CM0p/device/system_psoc6ble_cm0plus.c
        }
        else
        {
            pathFreqHz = srcFreqHz;
        }
    }
    else
    {
        /* Direct */
        pathFreqHz = srcFreqHz;
    }

    /* Get frequency after hf_clk pre-divider */
    pathFreqHz = pathFreqHz >> _FLD2VAL(SRSS_CLK_ROOT_SELECT_ROOT_DIV, SRSS->CLK_ROOT_SELECT[0u]);
    cy_Hfclk0FreqHz = pathFreqHz;

    /* Slow Clock Divider */
    slowClkDiv = 1u + _FLD2VAL(CPUSS_CM0_CLOCK_CTL_SLOW_INT_DIV, CPUSS->CM0_CLOCK_CTL);

    /* Peripheral Clock Divider */
    periClkDiv = 1u + _FLD2VAL(CPUSS_CM0_CLOCK_CTL_PERI_INT_DIV, CPUSS->CM0_CLOCK_CTL);

    pathFreqHz = pathFreqHz / periClkDiv;
    cy_PeriClkFreqHz = pathFreqHz;
    pathFreqHz = pathFreqHz / slowClkDiv;
    SystemCoreClock = pathFreqHz;

    /* Sets clock frequency for Delay API */
    cy_delayFreqHz = SystemCoreClock;
    cy_delayFreqMhz = (uint8_t)((cy_delayFreqHz + CY_DELAY_1M_MINUS_1_THRESHOLD) / CY_DELAY_1M_THRESHOLD);
    cy_delayFreqKhz = (cy_delayFreqHz + CY_DELAY_1K_MINUS_1_THRESHOLD) / CY_DELAY_1K_THRESHOLD;
    cy_delay32kMs   = CY_DELAY_MS_OVERFLOW_THRESHOLD * cy_delayFreqKhz;
}


/*******************************************************************************
* Function Name: Cy_SystemInitIpcCyPipeIsr
****************************************************************************//**
*
* This is the Interrupt Service Routine for the Cypress Pipe.
*
*******************************************************************************/
void Cy_SystemInitIpcCyPipeIsr(void)
{
    Cy_IPC_PIPE_ExecCallback(&cy_ipc_pipe_sysEpArray[CY_IPC_EP_CYPIPE_ADDR]);
}


/*******************************************************************************
* Function Name: Cy_SystemInitIpc
****************************************************************************//**
*
* Performs initial IPC configuration.
*
*******************************************************************************/
void Cy_SystemInitIpc(void)
{
    cy_stc_sysint_t ipc_intr_cypipeConfig;

    Cy_IPC_PIPE_Config(cy_ipc_pipe_sysEpArray);

    #if (CY_CPU_CORTEX_M0P)
        /* Initialize the lock subsystem. Should be called only on one CPU. */
        (void) Cy_IPC_LOCK_Init(CY_IPC_LOCK_COUNT, ipcLockArray);
    #endif  /* (CY_CPU_CORTEX_M0P) */

    /* Initialize the pipe endpoints */
    Cy_IPC_PIPE_Init(CY_IPC_EP_CYPIPE_ADDR, ipc_pipe_cyPipeCbArray, CY_IPC_CYPIPE_CLIENT_CNT, CY_IPC_CYPIPE_CONFIG);

    /* Configure interrupts */
    ipc_intr_cypipeConfig.intrSrc      = CY_IPC_INTR_CYPIPE_SRC;
    ipc_intr_cypipeConfig.intrCm0p     = CY_IPC_INTR_CYPIPE_CM0SRC;
    ipc_intr_cypipeConfig.intrPriority = CY_IPC_INTR_CYPIPE_PRIO;

    Cy_SysInt_Init(&ipc_intr_cypipeConfig, &Cy_SystemInitIpcCyPipeIsr);
    #if (CY_CPU_CORTEX_M0P)
        NVIC_EnableIRQ((IRQn_Type)ipc_intr_cypipeConfig.intrCm0p);
    #else
        NVIC_EnableIRQ((IRQn_Type)ipc_intr_cypipeConfig.intrSrc);
    #endif
}


/*******************************************************************************
* Function Name: Cy_SysGetCM4Status
****************************************************************************//**
*
* Gets the Cortex-M4 core mode.
*
* \return \ref group_startup_macro
*
*******************************************************************************/
uint32_t Cy_SysGetCM4Status(void)
{
    uint32_t returnValue;
    uint32_t regValue;

    regValue = CPUSS->CM4_PWR_CTL & CPUSS_CM4_PWR_CTL_Msk;
    switch(regValue)
    {
    case CPUSS_CM4_PWR_CTL_DISABLED:
        returnValue = CY_SYS_CM4_STATUS_DISABLED;
    break;

    case CPUSS_CM4_PWR_CTL_RETAINED:
        returnValue = CY_SYS_CM4_STATUS_RETAINED;
    break;

    case CPUSS_CM4_PWR_CTL_ENABLED:
        returnValue = CY_SYS_CM4_STATUS_ENABLED;
    break;

    case CPUSS_CM4_PWR_CTL_RESET_MODE:
        returnValue = CY_SYS_CM4_STATUS_RESET;
    break;

    default:
        returnValue = CY_SYS_CM4_STATUS_UNKNOWN;
    break;
    }

    return (returnValue);
}


/*******************************************************************************
* Function Name: Cy_SysEnableCM4
****************************************************************************//**
*
* Enables the Cortex-M4 core. The CPU is enabled once if it was in the disabled
* or retained mode. If the CPU is enabled, the vector table base address is
* updated and software reset of the Cortex-M4 core is performed.
*
* \param vectorTableOffset The offset of the vector table base address from
* memory address 0x00000000. The offset should be multiple to 1024 bytes.
*
*******************************************************************************/
void Cy_SysEnableCM4(uint32_t vectorTableOffset)
{
    uint32_t cm4Status;
    uint32_t  interruptState;

    interruptState = Cy_SaveIRQ();
    cm4Status = Cy_SysGetCM4Status();

    switch(cm4Status)
    {
    case CY_SYS_CM4_STATUS_DISABLED:
        CPUSS->CM4_VECTOR_TABLE_BASE = vectorTableOffset;

        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_POWER,   1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_ISOLATE, 1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
    break;

    case CY_SYS_CM4_STATUS_RETAINED:
        CPUSS->CM4_VECTOR_TABLE_BASE = vectorTableOffset;

        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_POWER,   1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_RETAIN,  1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_ISOLATE, 1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
    break;

    case CY_SYS_CM4_STATUS_RESET:
        CPUSS->CM4_VECTOR_TABLE_BASE = vectorTableOffset;

        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
    break;

    case CY_SYS_CM4_STATUS_ENABLED:
        CPUSS->CM4_VECTOR_TABLE_BASE = vectorTableOffset;

        /* Move to Reset from Enabled state */
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);

