ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/TARGET_PSoC6_CY8C_CM0p/device/system_psoc6ble_cm0plus.c
        /* Move to Enabled from Reset state */
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
    break;

    default:
        /* Do nothing if Cortex-M4 is already enabled. */
    break;
    }

    Cy_RestoreIRQ(interruptState);
}


/*******************************************************************************
* Function Name: Cy_SysDisableCM4
****************************************************************************//**
*
* Disables the Cortex-M4 core.
*
* \warning Do not call the function while the Cortex-M4 is executing because
* such a call may corrupt/abort a pending bus-transaction by the CPU and cause
* unexpected behavior in the system including a deadlock. Call the function
* while the Cortex-M4 core is in the Sleep or Deep Sleep low-power mode. Use
* the \ref group_syspm Power Management (syspm) API to put the CPU into the
* low-power modes. Use the \ref SysPm_ReadStatus() to get a status of the CPU.
*
*******************************************************************************/
void Cy_SysDisableCM4(void)
{
    uint32_t cm4Status;
    uint32_t  interruptState;

    interruptState = Cy_SaveIRQ();
    cm4Status = Cy_SysGetCM4Status();

    switch(cm4Status)
    {
    case CY_SYS_CM4_STATUS_ENABLED:
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_ISOLATE, 1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_POWER,   1UL);
    break;

    case CY_SYS_CM4_STATUS_RETAINED:
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_RETAIN,  1UL);
    break;

    default:
        /* Do nothing if Cortex-M4 is already disabled. */
    break;
    }

    Cy_RestoreIRQ(interruptState);
}


/*******************************************************************************
* Function Name: Cy_SysRetainCM4
****************************************************************************//**
*
* Retains the Cortex-M4 core.
*
* \warning Do not call the function while the Cortex-M4 is executing because
* such a call may corrupt/abort a pending bus-transaction by the CPU and cause
* unexpected behavior in the system including a deadlock. Call the function
* while the Cortex-M4 core is in the Sleep or Deep Sleep low-power mode. Use
* the \ref group_syspm Power Management (syspm) API to put the CPU into the
* low-power modes. Use the \ref Cy_SysPm_ReadStatus() to get a status of the CPU.
*
*******************************************************************************/
void Cy_SysRetainCM4(void)
{
    uint32_t cm4Status;
    uint32_t  interruptState;

    interruptState = Cy_SaveIRQ();
    cm4Status = Cy_SysGetCM4Status();

    switch(cm4Status)
    {
    case CY_SYS_CM4_STATUS_ENABLED:
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_ISOLATE, 1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_RETAIN,  1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_POWER,   1UL);
    break;

    case CY_SYS_CM4_STATUS_DISABLED:
        /* Switch from the DISABLED to the RETAINED state is not valid.
         * Do nothing in this case. */
    break;

        default:
            /* Do nothing if Cortex-M4 is already in the RETAINED state. */
        break;
        }

    Cy_RestoreIRQ(interruptState);
}


/*******************************************************************************
* Function Name: Cy_SysResetCM4
****************************************************************************//**
*
* Resets the Cortex-M4 core.
*
* \warning Do not call the function while the Cortex-M4 is executing because
* such a call may corrupt/abort a pending bus-transaction by the CPU and cause
* unexpected behavior in the system including a deadlock. Call the function
* while the Cortex-M4 core is in the Sleep or Deep Sleep low-power mode. Use
* the \ref group_syspm Power Management (syspm) API to put the CPU into the
* low-power modes. Use the \ref Cy_SysPm_ReadStatus() to get a status of the CPU.
*
*******************************************************************************/
void Cy_SysResetCM4(void)
{
    uint32_t cm4Status;
    uint32_t  interruptState;

    interruptState = Cy_SaveIRQ();
    cm4Status = Cy_SysGetCM4Status();

    switch(cm4Status)
    {
    case CY_SYS_CM4_STATUS_ENABLED:
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_CLOCK,   1UL);
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_RESET,   1UL);
    break;

    case CY_SYS_CM4_STATUS_DISABLED:
        CPUSS->CM4_PWR_CTL |=  _VAL2FLD(CPUSS_CM4_PWR_CTL_ISOLATE, 1UL);
        CPUSS->CM4_PWR_CTL &= ~_VAL2FLD(CPUSS_CM4_PWR_CTL_POWER,   1UL);
    break;

        default:
            /* Do nothing if Cortex-M4 is already in the RETAINED state. */
        break;
        }

    Cy_RestoreIRQ(interruptState);
}


/* [] END OF FILE */
